scores = []  # Створеюю порожній список для балів студентів

students_number = int(input("Введіть кількість студентів Вашої групи:"))  # Створюю запит в користувача на введення кількості студентів у групі

for student in range(students_number):  # За допомогою циклу for, проходжусь по кожному студенту
    score = int(input("Введіть бал Вашого студента: "))  # Створюю запит в користувача ввести бали студента
    scores.append(score)  # Додаю цей бал до списку scores

scores_sum = 0
for score in scores:  # Використовуючи цикл for, обчислюю суму всіх балів у списку scores
    scores_sum += score

score_average = scores_sum / students_number  # Розділяю суму на кількість студентів, щоб знайти середній бал

print("Середній бал Вашої групи:", score_average)  # Виводжу середній бал на екран
