# Це файл для твого роз'язку

student_scores = []
# Створення порожнього списку для балів студентів

students = int(input("Введіть кількість студентів у групі: "))
# Запит користувача на введення кількості студентів у групі

for i in range(students):
    score = int(input(f"Введіть бал для студента {i + 1}: "))
    student_scores.append(score)  
# Додамо бал до списку scores.
# Зчитування балів студентів та додавання їх до списку

all_scores = sum(student_scores)
# Обчислення суми балів

a = all_scores / students 
# Обчислення середнього балу

print("Середній бал:", a)
# Виведення результату на екран

