# Це файл для твого роз'язку


# Створення порожнього списку для балів студентів
scores = []

# Запит користувача на введення кількості студентів у групі
students = int(input('вкажіть кількість студентів у групі:'))

# Зчитування балів студентів та додавання їх до списку
for i in range(students):
    rating_stud = int(input('вкажіть оцінку студента:'))
    scores.append(rating_stud)

# Обчислення суми балів
for i in scores:
    sum_rating = sum(scores)

# Обчислення середнього балу
avarage = sum_rating / students

# Виведення результату на екран
print(f'середній бал студентів є:', avarage)
