# Це файл для твого роз'язку


# Створення порожнього списку для балів студентів
scores = []

# Запит користувача на введення кількості студентів у групі
students_count = int(input('Введіть кількість студентів: '))

# Зчитування балів студентів та додавання їх до списку
for i in range(students_count):
      scores.append(int(input('Введіть оцінку:  ')))


# Обчислення суми балів
sum_score = sum(scores)

# Обчислення середнього балу
avg_score = sum_score/students_count

# Виведення результату на екран
print(f'Середня оцінка: {avg_score}, усього {students_count} студента(ів)')

