# Це файл для твого роз'язку

# Створення порожнього списку для балів студентів
scores = []

# Запит користувача на введення кількості студентів у групі
num_stud = int(input('Введіть к-сть студентів у групі: '))

# Зчитування балів студентів та додавання їх до списку
for i in range(num_stud):
    stud_score = int(input(f'Введіть бал студента №{i + 1}: '))
    scores.append(stud_score) 

# Обчислення суми балів
for i in scores:
    sum_points = sum(scores)

# Обчислення середнього балу
avarege = sum_points / num_stud

# Виведення результату на екран
print(f'Середній бал студентів є:', avarege)