# Це файл для твого роз'язку


# Створення порожнього списку для балів студентів
scores=[]

# Запит користувача на введення кількості студентів у групі
student_num = int(input("Введіть кількість студентів у групі: "))



# Зчитування балів студентів та додавання їх до списку
for i in range(student_num):
 scor= float(input(f"Введіть бал студента №{i+1}:"))
 scores . append (scor)

# Обчислення суми балів
 scor_sum = sum(scores)

# Обчислення середнього балу
scor_everage = scor_sum/student_num

# Виведення результату на екран
print("Середній бал студентів: ",scor_everage)
